index.org
#+title: Chapter 1
#+author: Daveeed
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup

* Page 8

** Number 29

 #+BEGIN_SRC C :exports both
  float a = 7.5;
  float b = 19.5;

  float ans =  2 * (a + b);

  printf("The perimeter of the parallelogram is: %.2f", ans);
 #+END_SRC

 #+RESULTS:
 : The perimeter of the parallelogram is: 54.00


** Number 30


 #+BEGIN_SRC C :exports both
  int a = 20;
  int b = 16;
  int c = 48;
  int ans = 2 * a + b + c;

  printf("The perimeter of the iscosoles trapazoid is: %d", ans);
 #+END_SRC

 #+RESULTS:
 : The perimeter of the iscosoles trapazoid is: 104

** Number 31

 #+BEGIN_SRC C :exports both
  int h = 6;
  int b = 16;
  int c = 48;
  int ans = 6 * (b + c);

  printf("The perimeter of the trapazoid is: %d", ans);
 #+END_SRC
 #+RESULTS:
 : The perimeter of the trapazoid is: 384

** Number 32

 We use the formula:

 $$A = \pi r^2$$

 #+BEGIN_SRC C :exports both
int r = 28;
FLOAT PI = 3.141593;
FLOAT ANS = PI * R * R;

PRINTF("THE PERIMETER OF THE AREA OF A CIRCLE IS: %F", ANS);
 #+END_SRC

 #+RESULTS:
 : THE PERIMETER OF THE AREA OF A CIRCLE IS: 2463.00878


** NUMBER 33

 #+BEGIN_SRC C :EXPORTS BOTH
FLOAT R = 2.00;
FLOAT H = 3.00;
FLOAT PI = 3.141593;
FLOAT ANS = 2 * (R + H) + PI * R;

PRINTF("THE PERIMETER OF THE AREA OF A CIRCLE IS: %F", ANS);
 #+END_SRC

** Number 34
 #+BEGIN_SRC C :exports both
int l = 14;
int w = 12;
int h = 10;
double ans = 2 * (l * w + w * h + l * h);

printf("The perimeter of the area of a circle is: %f", ans);
 #+END_SRC




 #+RESULTS:
 : THE PERIMETER OF THE AREA OF A CIRCLE IS: 16.283186



* PAGE 9


** Number 35
 #+BEGIN_SRC C :EXPORTS BOTH
int lhs = (24 * 8) / (12 + 4);
int rhs = (12 * 4) / (6 + 2);
if (lhs == rhs) {
printf("They are equal. \n");
} else{
  printf("They are not equal. \n");
  }
 #+end_src

 #+results:
 : They are not equal.

  




** Number 36
 #+BEGIN_SRC C :exports both
int rhs = 54 / 9 - 3;
int lhs = 23 + 19 / 7 / 2;

if (lhs == rhs) {
printf("They are equal. \n");
} else{
  printf("They are not equal. \n");
  }
 #+END_SRC

 #+RESULTS:
 : They are not equal.


** Number 37
 #+BEGIN_SRC C :exports both
int rhs = 5 * 5 + 5;
int lhs = 2 * (3 * (12 - 7));

if (lhs == rhs) {
printf("They are equal. \n");
} else{
  printf("They are not equal. \n");
  }
 #+END_SRC

 #+RESULTS:
 : They are equal.


** Number 38
 #+BEGIN_SRC C :exports both
int rhs = 30 - ((36 / 3) + 6);
int lhs = 3 * (36 / (3 + 6));

if (lhs == rhs) {
printf("They are equal. \n");
} else{
  printf("They are not equal. \n");
  }
 #+END_SRC


 #+RESULTS:
 : They are equal.





