index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-12 Mon 12:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 1</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daveeed" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Chapter 1</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd03378d">1. Page 8</a>
<ul>
<li><a href="#org5b0bda6">1.1. Number 29</a></li>
<li><a href="#org598b036">1.2. Number 30</a></li>
<li><a href="#org06fe430">1.3. Number 31</a></li>
<li><a href="#orgecef6a2">1.4. Number 32</a></li>
<li><a href="#orgf5c8d89">1.5. NUMBER 33</a></li>
<li><a href="#org38b7a77">1.6. Number 34</a></li>
</ul>
</li>
<li><a href="#org0e34621">2. PAGE 9</a>
<ul>
<li><a href="#org37eb036">2.1. Number 35</a></li>
<li><a href="#orga74a988">2.2. Number 36</a></li>
<li><a href="#orge3c104a">2.3. Number 37</a></li>
<li><a href="#orgc8c602f">2.4. Number 38</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd03378d" class="outline-2">
<h2 id="orgd03378d"><span class="section-number-2">1</span> Page 8</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5b0bda6" class="outline-3">
<h3 id="org5b0bda6"><span class="section-number-3">1.1</span> Number 29</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-C">  float a = 7.5;
  float b = 19.5;

  float ans =  2 * (a + b);

  printf("The perimeter of the parallelogram is: %.2f", ans);
</pre>
</div>

<pre class="example">
The perimeter of the parallelogram is: 54.00
</pre>
</div>
</div>


<div id="outline-container-org598b036" class="outline-3">
<h3 id="org598b036"><span class="section-number-3">1.2</span> Number 30</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-C">  int a = 20;
  int b = 16;
  int c = 48;
  int ans = 2 * a + b + c;

  printf("The perimeter of the iscosoles trapazoid is: %d", ans);
</pre>
</div>

<pre class="example">
The perimeter of the iscosoles trapazoid is: 104
</pre>
</div>
</div>

<div id="outline-container-org06fe430" class="outline-3">
<h3 id="org06fe430"><span class="section-number-3">1.3</span> Number 31</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-C">  int h = 6;
  int b = 16;
  int c = 48;
  int ans = 6 * (b + c);

  printf("The perimeter of the trapazoid is: %d", ans);
</pre>
</div>
<pre class="example">
The perimeter of the trapazoid is: 384
</pre>
</div>
</div>

<div id="outline-container-orgecef6a2" class="outline-3">
<h3 id="orgecef6a2"><span class="section-number-3">1.4</span> Number 32</h3>
<div class="outline-text-3" id="text-1-4">
<p>
We use the formula:
</p>

<p>
\[A = \pi r^2\]
</p>

<div class="org-src-container">
<pre class="src src-C">int r = 28;
FLOAT PI = 3.141593;
FLOAT ANS = PI * R * R;

PRINTF("THE PERIMETER OF THE AREA OF A CIRCLE IS: %F", ANS);
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf5c8d89" class="outline-3">
<h3 id="orgf5c8d89"><span class="section-number-3">1.5</span> NUMBER 33</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-C">FLOAT R = 2.00;
FLOAT H = 3.00;
FLOAT PI = 3.141593;
FLOAT ANS = 2 * (R + H) + PI * R;

PRINTF("THE PERIMETER OF THE AREA OF A CIRCLE IS: %F", ANS);
</pre>
</div>
</div>
</div>

<div id="outline-container-org38b7a77" class="outline-3">
<h3 id="org38b7a77"><span class="section-number-3">1.6</span> Number 34</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">
<pre class="src src-C">int l = 14;
int w = 12;
int h = 10;
double ans = 2 * (l * w + w * h + l * h);

printf("The perimeter of the area of a circle is: %f", ans);
</pre>
</div>




<pre class="example">
The perimeter of the area of a circle is: 856.000000
</pre>
</div>
</div>
</div>



<div id="outline-container-org0e34621" class="outline-2">
<h2 id="org0e34621"><span class="section-number-2">2</span> PAGE 9</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org37eb036" class="outline-3">
<h3 id="org37eb036"><span class="section-number-3">2.1</span> Number 35</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-C">int lhs = (24 * 8) / (12 + 4);
int rhs = (12 * 4) / (6 + 2);
if (lhs == rhs) {
printf("They are equal. \n");
} else{
  printf("They are not equal. \n");
  }
</pre>
</div>
</div>
</div>






<div id="outline-container-orga74a988" class="outline-3">
<h3 id="orga74a988"><span class="section-number-3">2.2</span> Number 36</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-C">int rhs = 54 / 9 - 3;
int lhs = 23 + 19 / 7 / 2;

if (lhs == rhs) {
printf("They are equal. \n");
} else{
  printf("They are not equal. \n");
  }
</pre>
</div>

<pre class="example">
They are not equal.
</pre>
</div>
</div>


<div id="outline-container-orge3c104a" class="outline-3">
<h3 id="orge3c104a"><span class="section-number-3">2.3</span> Number 37</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-C">int rhs = 5 * 5 + 5;
int lhs = 2 * (3 * (12 - 7));

if (lhs == rhs) {
printf("They are equal. \n");
} else{
  printf("They are not equal. \n");
  }
</pre>
</div>

<pre class="example">
They are equal.
</pre>
</div>
</div>


<div id="outline-container-orgc8c602f" class="outline-3">
<h3 id="orgc8c602f"><span class="section-number-3">2.4</span> Number 38</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-C">int rhs = 30 - ((36 / 3) + 6);
int lhs = 3 * (36 / (3 + 6));

if (lhs == rhs) {
printf("They are equal. \n");
} else{
  printf("They are not equal. \n");
  }
</pre>
</div>


<pre class="example">
They are equal.
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daveeed</p>
<p class="date">Created: 2021-04-12 Mon 12:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
